// import { PrismaClient } from "@prisma/client"

// const db = [
//     {
//         "name": "Введение в Python",
//         "topic": "IT",
//         "description": "Курс предназначен для начинающих программистов. Вы изучите основы Python и научитесь решать простые задачи.",
//         "author": "Иван Петров",
//         "peopleMax": 200,
//         "price": 50.0
//     },
//     {
//         "name": "Основы бизнес-анализа",
//         "topic": "Бизнес",
//         "description": "Курс о том, как проводить анализ данных для принятия бизнес-решений.",
//         "author": "Дмитрий Иванов",
//         "peopleMax": 150,
//         "price": 70.0
//     },
//     {
//         "name": "Маркетинг в социальных сетях",
//         "topic": "Маркетинг",
//         "description": "Этот курс поможет вам разобраться с основами маркетинга в социальных сетях.",
//         "author": "Анна Сидорова",
//         "peopleMax": 180,
//         "price": 30.0
//     },
//     {
//         "name": "Графический дизайн",
//         "topic": "Дизайн",
//         "description": "Узнайте основы дизайна, создания логотипов и макетов.",
//         "author": "Елена Смирнова",
//         "peopleMax": 120,
//         "price": 60.0
//     },
//     {
//         "name": "Введение в статистику",
//         "topic": "Аналитика",
//         "description": "Курс о базовых понятиях статистики и методах анализа данных.",
//         "author": "Алексей Козлов",
//         "peopleMax": 170,
//         "price": 40.0
//     },
//     {
//         "name": "Продвинутый Python",
//         "topic": "IT",
//         "description": "Курс для опытных программистов, позволяющий углубить знания в Python и изучить продвинутые темы.",
//         "author": "Мария Соколова",
//         "peopleMax": 220,
//         "price": 80.0
//     },
//     {
//         "name": "Эффективный маркетинг",
//         "topic": "Маркетинг",
//         "description": "Как создать успешную маркетинговую стратегию и привлечь клиентов.",
//         "author": "Александр Иванов",
//         "peopleMax": 160,
//         "price": 45.0
//     },
//     {
//         "name": "Управление проектами",
//         "topic": "Бизнес",
//         "description": "Основы управления проектами: планирование, контроль и решение проблем.",
//         "author": "Екатерина Петрова",
//         "peopleMax": 140,
//         "price": 55.0
//     },
//     {
//         "name": "Дизайн интерфейсов",
//         "topic": "Дизайн",
//         "description": "Как создавать удобные и красивые пользовательские интерфейсы.",
//         "author": "Андрей Смирнов",
//         "peopleMax": 210,
//         "price": 65.0
//     },
//     {
//         "name": "Анализ данных с Python",
//         "topic": "Аналитика",
//         "description": "Изучите инструменты анализа данных с помощью Python.",
//         "author": "Ольга Козлова",
//         "peopleMax": 190,
//         "price": 50.0
//     },
//     {
//         "name": "JavaScript для веб-разработки",
//         "topic": "IT",
//         "description": "Основы языка JavaScript и его применение в веб-разработке.",
//         "author": "Николай Сидоров",
//         "peopleMax": 200,
//         "price": 60.0
//     },
//     {
//         "name": "Современный маркетинг",
//         "topic": "Маркетинг",
//         "description": "Тенденции и инструменты современного маркетинга.",
//         "author": "Елена Иванова",
//         "peopleMax": 150,
//         "price": 35.0
//     },
//     {
//         "name": "Финансовый анализ",
//         "topic": "Бизнес",
//         "description": "Как проводить анализ финансовой отчетности компании.",
//         "author": "Алексей Петров",
//         "peopleMax": 180,
//         "price": 75.0
//     },
//     {
//         "name": "UI/UX дизайн",
//         "topic": "Дизайн",
//         "description": "Проектирование пользовательского интерфейса и опыта пользователя.",
//         "author": "Марина Смирнова",
//         "peopleMax": 130,
//         "price": 70.0
//     },
//     {
//         "name": "Статистический анализ данных",
//         "topic": "Аналитика",
//         "description": "Основы статистики и ее применение в анализе данных.",
//         "author": "Антон Козлов",
//         "peopleMax": 160,
//         "price": 45.0
//     }
// ]

export default function page() {


    //     db.forEach(async (el) => {
    //         const resp = await prisma.course.create({
    //             data: {
    //                 name: el.name,
    //                 topic: el.topic,
    //                 description: el.description,
    //                 author: el.author,
    //                 peopleMax: el.peopleMax,
    //                 price: el.price
    //             }
    //         })
    //     })

    return (
        <div>page</div>
    )
}
